Revit 2026 API

# IFCHybridImportImportElements(Document, String, IFCHybridImportOptions) Method

---

Imports IFC Elements using AnyCAD.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> ImportElements(
	Document doc,
	string file,
	IFCHybridImportOptions options
)
```
```vb
Public Function ImportElements (
	doc As Document,
	file As String,
	options As IFCHybridImportOptions
) As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ ImportElements(
	Document^ doc,
	String^ file,
	IFCHybridImportOptions^ options
)
```
```fsharp
member ImportElements :
        doc : Document *
        file : string *
        options : IFCHybridImportOptions -> IList<ElementId>
```

#### Parameters

doc Document
     Document to receive elements from the IFC file import.
file String
     Full path of the file to import.
options IFCHybridImportOptions
     The hybrid import options.

#### Return Value

IListElementId Returns an array of ElementIds representing created elements.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCHybridImport Class

ImportElements Overload

Autodesk.Revit.DB.IFC Namespace